cmsis-svd/cmsis-svd/data/Atmel/ATSAME54P19A.svd
            <register>
               <name>DSEQCTRL</name>
               <description>DMA Sequential Control</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INPUTCTRL</name>
                     <description>Input Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTRLB</name>
                     <description>Control B</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFCTRL</name>
                     <description>Reference Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AVGCTRL</name>
                     <description>Average Control</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAMPCTRL</name>
                     <description>Sampling Time Control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WINLT</name>
                     <description>Window Monitor Lower Threshold</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WINUT</name>
                     <description>Window Monitor Upper Threshold</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GAINCORR</name>
                     <description>Gain Correction</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSETCORR</name>
                     <description>Offset Correction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTOSTART</name>
                     <description>ADC Auto-Start Conversion</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSEQSTAT</name>
               <description>DMA Sequencial Status</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INPUTCTRL</name>
                     <description>Input Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTRLB</name>
                     <description>Control B</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFCTRL</name>
                     <description>Reference Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AVGCTRL</name>
                     <description>Average Control</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAMPCTRL</name>
                     <description>Sampling Time Control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WINLT</name>
                     <description>Window Monitor Lower Threshold</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WINUT</name>
                     <description>Window Monitor Upper Threshold</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GAINCORR</name>
                     <description>Gain Correction</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSETCORR</name>
                     <description>Offset Correction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>DMA Sequencing Busy</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESULT</name>
               <description>Result Conversion Value</description>
               <addressOffset>0x40</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>RESULT</name>
                     <description>Result Conversion Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESS</name>
               <description>Last Sample Result</description>
               <addressOffset>0x44</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>RESS</name>
                     <description>Last ADC conversion result</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALIB</name>
               <description>Calibration</description>
               <addressOffset>0x48</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>BIASCOMP</name>
                     <description>Bias Comparator Scaling</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>BIASR2R</name>
                     <description>Bias R2R Ampli scaling</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>BIASREFBUF</name>
                     <description>Bias  Reference Buffer Scaling</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
