cmsis-svd/cmsis-svd/data/Atmel/ATSAME54P19A.svd
            <register>
               <name>PSR</name>
               <description>Present State</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00F80000</resetValue>
               <fields>
                  <field>
                     <name>CMDINHC</name>
                     <description>Command Inhibit (CMD)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMDINHCSelect</name>
                        <enumeratedValue>
                           <name>CAN</name>
                           <description>Can issue command using only CMD line</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CANNOT</name>
                           <description>Cannot issue command</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDINHD</name>
                     <description>Command Inhibit (DAT)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMDINHDSelect</name>
                        <enumeratedValue>
                           <name>CAN</name>
                           <description>Can issue command which uses the DAT line</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CANNOT</name>
                           <description>Cannot issue command which uses the DAT line</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DLACT</name>
                     <description>DAT Line Active</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DLACTSelect</name>
                        <enumeratedValue>
                           <name>INACTIVE</name>
                           <description>DAT Line Inactive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACTIVE</name>
                           <description>DAT Line Active</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTREQ</name>
                     <description>Re-Tuning Request</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RTREQSelect</name>
                        <enumeratedValue>
                           <name>OK</name>
                           <description>Fixed or well-tuned sampling clock</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REQUIRED</name>
                           <description>Sampling clock needs re-tuning</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WTACT</name>
                     <description>Write Transfer Active</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WTACTSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No valid data</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Transferring data</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTACT</name>
                     <description>Read Transfer Active</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RTACTSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No valid data</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Transferring data</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BUFWREN</name>
                     <description>Buffer Write Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BUFWRENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Write disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Write enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BUFRDEN</name>
                     <description>Buffer Read Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BUFRDENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Read disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Read enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CARDINS</name>
                     <description>Card Inserted</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CARDINSSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Reset or Debouncing or No Card</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Card inserted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CARDSS</name>
                     <description>Card State Stable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CARDSSSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Reset or Debouncing</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>No Card or Insered</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CARDDPL</name>
                     <description>Card Detect Pin Level</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CARDDPLSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No card present (SDCD#=1)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Card present (SDCD#=0)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WRPPL</name>
                     <description>Write Protect Pin Level</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WRPPLSelect</name>
                        <enumeratedValue>
                           <name>PROTECTED</name>
                           <description>Write protected (SDWP#=0)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Write enabled (SDWP#=1)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATLL</name>
                     <description>DAT[3:0] Line Level</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CMDLL</name>
                     <description>CMD Line Level</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HC1R</name>
               <description>Host Control 1</description>
               <addressOffset>0x28</addressOffset>
               <size>8</size>
               <resetValue>0xE00</resetValue>
               <fields>
                  <field>
                     <name>LEDCTRL</name>
                     <description>LED Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LEDCTRLSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>LED off</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>LED on</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DW</name>
                     <description>Data Width</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DWSelect</name>
                        <enumeratedValue>
                           <name>1BIT</name>
                           <description>1-bit mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4BIT</name>
                           <description>4-bit mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HSEN</name>
                     <description>High Speed Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HSENSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal Speed mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High Speed mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMASEL</name>
                     <description>DMA Select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DMASELSelect</name>
                        <enumeratedValue>
                           <name>SDMA</name>
                           <description>SDMA is selected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32BIT</name>
                           <description>32-bit Address ADMA2 is selected</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CARDDTL</name>
                     <description>Card Detect Test Level</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CARDDTLSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Card</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Card Inserted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CARDDSEL</name>
                     <description>Card Detect Signal Selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CARDDSELSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>SDCD# is selected (for normal use)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TEST</name>
                           <description>The Card Select Test Level is selected (for test purpose)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HC1R_EMMC_MODE</name>
               <description>Host Control 1</description>
               <alternateRegister>HC1R</alternateRegister>
               <addressOffset>0x28</addressOffset>
               <size>8</size>
               <resetValue>0xE00</resetValue>
               <fields>
                  <field>
                     <name>DW</name>
                     <description>Data Width</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DWSelect</name>
                        <enumeratedValue>
                           <name>1BIT</name>
                           <description>1-bit mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4BIT</name>
                           <description>4-bit mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HSEN</name>
                     <description>High Speed Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HSENSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal Speed mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High Speed mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMASEL</name>
                     <description>DMA Select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DMASELSelect</name>
                        <enumeratedValue>
                           <name>SDMA</name>
                           <description>SDMA is selected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32BIT</name>
                           <description>32-bit Address ADMA2 is selected</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCR</name>
               <description>Power Control</description>
               <addressOffset>0x29</addressOffset>
               <size>8</size>
               <resetValue>0x0E</resetValue>
               <fields>
                  <field>
                     <name>SDBPWR</name>
                     <description>SD Bus Power</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SDBPWRSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Power off</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Power on</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SDBVSEL</name>
                     <description>SD Bus Voltage Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SDBVSELSelect</name>
                        <enumeratedValue>
                           <name>1V8</name>
                           <description>1.8V (Typ.)</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3V0</name>
                           <description>3.0V (Typ.)</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3V3</name>
                           <description>3.3V (Typ.)</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
