cmsis-svd/cmsis-svd/data/Atmel/ATSAME54P19A.svd
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Busy</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Swrst Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTRLB</name>
                     <description>Ctrlb Busy</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STATUS</name>
                     <description>Status Busy</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COUNT</name>
                     <description>Count Busy</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PATT</name>
                     <description>Pattern Busy</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAVE</name>
                     <description>Wave Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>Period Busy</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC0</name>
                     <description>Compare Channel 0 Busy</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1</name>
                     <description>Compare Channel 1 Busy</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2</name>
                     <description>Compare Channel 2 Busy</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC3</name>
                     <description>Compare Channel 3 Busy</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC4</name>
                     <description>Compare Channel 4 Busy</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC5</name>
                     <description>Compare Channel 5 Busy</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCTRLA</name>
               <description>Recoverable Fault A Configuration</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC</name>
                     <description>Fault A Source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SRCSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Fault input disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>MCEx (x=0,1) event input</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERT</name>
                           <description>Inverted MCEx (x=0,1) event input</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALTFAULT</name>
                           <description>Alternate fault (A or B) state at the end of the previous period</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEEP</name>
                     <description>Fault A Keeper</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QUAL</name>
                     <description>Fault A Qualification</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLANK</name>
                     <description>Fault A Blanking Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BLANKSelect</name>
                        <enumeratedValue>
                           <name>START</name>
                           <description>Blanking applied from start of the ramp</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Blanking applied from rising edge of the output waveform</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Blanking applied from falling edge of the output waveform</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Blanking applied from each toggle of the output waveform</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESTART</name>
                     <description>Fault A Restart</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HALT</name>
                     <description>Fault A Halt Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>HALTSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Halt action disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HW</name>
                           <description>Hardware halt action</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW</name>
                           <description>Software halt action</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NR</name>
                           <description>Non-recoverable fault</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHSEL</name>
                     <description>Fault A Capture Channel</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CHSELSelect</name>
                        <enumeratedValue>
                           <name>CC0</name>
                           <description>Capture value stored in channel 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC1</name>
                           <description>Capture value stored in channel 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC2</name>
                           <description>Capture value stored in channel 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC3</name>
                           <description>Capture value stored in channel 3</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAPTURE</name>
                     <description>Fault A Capture Action</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CAPTURESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>No capture</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPT</name>
                           <description>Capture on fault</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPTMIN</name>
                           <description>Minimum capture</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPTMAX</name>
                           <description>Maximum capture</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCMIN</name>
                           <description>Minimum local detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCMAX</name>
                           <description>Maximum local detection</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DERIV0</name>
                           <description>Minimum and maximum local detection</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPTMARK</name>
                           <description>Capture with ramp index as MSB value</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BLANKPRESC</name>
                     <description>Fault A Blanking Prescaler</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLANKVAL</name>
                     <description>Fault A Blanking Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FILTERVAL</name>
                     <description>Fault A Filter Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCTRLB</name>
               <description>Recoverable Fault B Configuration</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC</name>
                     <description>Fault B Source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SRCSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Fault input disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>MCEx (x=0,1) event input</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERT</name>
                           <description>Inverted MCEx (x=0,1) event input</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALTFAULT</name>
                           <description>Alternate fault (A or B) state at the end of the previous period</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEEP</name>
                     <description>Fault B Keeper</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QUAL</name>
                     <description>Fault B Qualification</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLANK</name>
                     <description>Fault B Blanking Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BLANKSelect</name>
                        <enumeratedValue>
                           <name>START</name>
                           <description>Blanking applied from start of the ramp</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Blanking applied from rising edge of the output waveform</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Blanking applied from falling edge of the output waveform</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Blanking applied from each toggle of the output waveform</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESTART</name>
                     <description>Fault B Restart</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HALT</name>
                     <description>Fault B Halt Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>HALTSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Halt action disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HW</name>
                           <description>Hardware halt action</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW</name>
                           <description>Software halt action</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NR</name>
                           <description>Non-recoverable fault</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHSEL</name>
                     <description>Fault B Capture Channel</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CHSELSelect</name>
                        <enumeratedValue>
                           <name>CC0</name>
                           <description>Capture value stored in channel 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC1</name>
                           <description>Capture value stored in channel 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC2</name>
                           <description>Capture value stored in channel 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC3</name>
                           <description>Capture value stored in channel 3</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAPTURE</name>
                     <description>Fault B Capture Action</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CAPTURESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>No capture</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPT</name>
                           <description>Capture on fault</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPTMIN</name>
                           <description>Minimum capture</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPTMAX</name>
                           <description>Maximum capture</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCMIN</name>
                           <description>Minimum local detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCMAX</name>
                           <description>Maximum local detection</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DERIV0</name>
                           <description>Minimum and maximum local detection</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPTMARK</name>
                           <description>Capture with ramp index as MSB value</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BLANKPRESC</name>
                     <description>Fault B Blanking Prescaler</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLANKVAL</name>
                     <description>Fault B Blanking Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FILTERVAL</name>
                     <description>Fault B Filter Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
